
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// Проверка наличия доступных посещений (запрос к регистру остатков)	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПосещенияКлиентовОстатки.Клиент КАК Клиент,
	|	ПосещенияКлиентовОстатки.ПосещениеОстаток КАК ПосещениеОстаток
	|ИЗ
	|	РегистрНакопления.ПосещенияКлиентов.Остатки(, Клиент = &Клиент) КАК ПосещенияКлиентовОстатки";
	
	Запрос.УстановитьПараметр("Клиент", Клиент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();	
	
	Если Не Выборка.Следующий() Тогда
		Сообщить("У клиента нет доступных посещений!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	// регистр ОстатокПосещенийКлиентов Расход
	Движения.ПосещенияКлиентов.Записывать = Истина;
	Движение = Движения.ПосещенияКлиентов.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период      = Дата;
	Движение.Клиент      = Клиент;
	Движение.Посещение   = Посещение;
	
КонецПроцедуры

