Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// Проверка присутствия данных
	Если ЗакупленныеПродукты.Количество() = 0 Тогда
		Сообщить("Добавьте данные в таблицу!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// Флаг обработки проведения Истина
	Движения.ОстаткиПродуктов.Записывать = Истина;
	
	// Группировка продуктов с суммой количества из данной таблицы	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПоступлениеПродуктовЗакупленныеПродукты.Продукт КАК Продукт,
	               |	СУММА(ПоступлениеПродуктовЗакупленныеПродукты.Количество) КАК Количество,
	               |	СУММА(ПоступлениеПродуктовЗакупленныеПродукты.Цена) КАК Цена
	               |ИЗ
	               |	Документ.ПоступлениеПродуктов.ЗакупленныеПродукты КАК ПоступлениеПродуктовЗакупленныеПродукты
	               |ГДЕ
	               |	ПоступлениеПродуктовЗакупленныеПродукты.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПоступлениеПродуктовЗакупленныеПродукты.Продукт";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	// Запись полученных из базы значений
	Пока Выборка.Следующий() Цикл
		Движение = Движения.Продукты.Добавить();
		Движение.ВидДвижения  = ВидДвиженияНакопления.Приход;
		Движение.Период       = Дата;
		Движение.Продукт 	  = Выборка.Продукт;
		Движение.Количество   = Выборка.Количество;
		Движение.Сумма 		  = Выборка.Цена * Выборка.Количество;
	КонецЦикла;
	
КонецПроцедуры
